; domain
(define (domain rts_game)
    (:requirements :strips :typing :negative-preconditions)
	(:constants 
		level0 - level_type
		level1 - level_type)
    (:types 
    	
        entity entity_type - object
    	building unit level_type - entity
    	building_type unit_type - entity_type
    )

    (:predicates  
    	(occupied ?u - unit)
    	(trained ?u - unit)
		(b_level ?b - building ?l - level_type)
    	(builder ?u - unit_type)
        (produces ?u - unit_type ?b - building_type ?l - level_type)
        (utype ?u - unit ?u2 - unit_type)
        (btype ?b - building ?b2 - building_type)
        (upgrades ?b - building_type ?b2 - building_type)
        (upgradable ?b - building_type ?l - level_type)
    )

    (:action train_unit
	     :parameters (?u - unit ?ut - unit_type ?b - building ?bt - building_type ?l - level_type)
	     :precondition (and
	     	; Unit not trained
	         (not (trained ?u))
	         
	        ;  building is of sufficient level to train
	         (btype ?b ?bt)
	         (utype ?u ?ut)
	         (b_level ?b ?l)
	         (produces ?ut ?bt ?l)
	         
	     )
	     :effect (and 
	     	; Worker is trained
            (trained ?u)
            
         )
    )

    (:action build_building
    	:parameters(?u - unit ?ut - unit_type ?b - building)
    	:precondition (and
    		; worker is available
    		(trained ?u)
    		(utype ?u ?ut)
    		(builder ?ut)
    		(not (occupied ?u))
    		
    		; building is not built
    		(b_level ?b level0)

    	)
    	:effect (and
    		; build building
    		(not (b_level ?b level0))
    		(b_level ?b level1)
    		
    		; worker is occupied
    		(occupied ?u)

    	)
    )
    
	(:action finish_occupied
    	:parameters(?u - unit)
    	:precondition (and
    		(occupied ?u)
    	)
    	:effect (and
    		(not (occupied ?u))
    	)
    )
    
    (:action upgrade_building
    	:parameters(?b - building ?t - building ?bt - building_type ?tt - building_type ?l - level_type ?l2 - level_type)
    	:precondition (and
    		; building is levelx and not levelx + 1
    		(b_level ?b ?l)
    		(not (b_level ?b ?l2))
    		
    		; buildings are of the right type
    		(btype ?b ?bt)
    		(btype ?t ?tt)
    		
    		; building tt upgrades bt
    		(upgrades ?bt ?tt)
    		(b_level ?t level1)
    		
    		; building bt can be upgraded
    		(upgradable ?bt ?l2)

    	)
    	:effect (and
    		; next building level
    		(b_level ?b ?l2)
    	)
    )
)

; problem
(define (problem rts5)
    (:domain rts_game)
    (:objects
        
        level2 - level_type

        base - building_type
        barracks - building_type
        tank_factory - building_type
        tech_facility - building_type

        base1 - building
        barracks1 - building
        tank_factory1 - building
        tank_factory2 - building
        tech_facility1 - building

        worker - unit_type
        light_infantry - unit_type
        tank - unit_type
        siege_tank - unit_type

        worker1 - unit
        worker2 - unit
        light_infantry1 - unit
        light_infantry2 - unit
        tank1 - unit
        siege_tank1 - unit
        siege_tank2 - unit
    )
    (:init
        (utype worker1 worker)
        (utype light_infantry1 light_infantry)
        (utype light_infantry2 light_infantry)
        (utype tank1 tank)
        (utype siege_tank1 siege_tank)
        (utype siege_tank2 siege_tank)

        (btype base1 base)
        (btype barracks1 barracks)
        (btype tank_factory1 tank_factory)
        (btype tank_factory2 tank_factory)
        (btype tech_facility1 tech_facility)

        (upgradable tank_factory level2)
        (upgrades tank_factory tech_facility)

        (builder worker)

        (produces worker base level1)
        (produces light_infantry barracks level1)
        (produces tank tank_factory level1)
        (produces siege_tank tank_factory level2)

        (b_level base1 level0)
        (b_level barracks1 level0)
        (b_level tank_factory1 level0)
        (b_level tank_factory2 level0)
        (b_level tech_facility1 level0)

        (trained worker1)

    )

    (:goal (and
        (trained light_infantry1)
        (trained light_infantry2)
        (trained tank1)
        (trained siege_tank1)
        (trained siege_tank2)
    ))
)

; plan
1. (build_building worker1 worker barracks1)
   deleted: (b_level barracks1 level0)
   added: (b_level barracks1 level1) (occupied worker1)
   goals met: 0 of 5
2. (finish_occupied worker1)
   deleted: (occupied worker1)
   goals met: 0 of 5
3. (train_unit light_infantry2 light_infantry barracks1 barracks level1)
   added: (trained light_infantry2)
   goals met: 1 of 5
4. (train_unit light_infantry1 light_infantry barracks1 barracks level1)
   added: (trained light_infantry1)
   goals met: 2 of 5
5. (build_building worker1 worker tank_factory1)
   deleted: (b_level tank_factory1 level0)
   added: (b_level tank_factory1 level1) (occupied worker1)
   goals met: 2 of 5
6. (finish_occupied worker1)
   deleted: (occupied worker1)
   goals met: 2 of 5
7. (build_building worker1 worker tech_facility1)
   deleted: (b_level tech_facility1 level0)
   added: (b_level tech_facility1 level1) (occupied worker1)
   goals met: 2 of 5
8. (upgrade_building tank_factory2 tech_facility1 tank_factory tech_facility level0 level2)
   added: (b_level tank_factory2 level2)
   goals met: 2 of 5
9. (train_unit siege_tank2 siege_tank tank_factory2 tank_factory level2)
   added: (trained siege_tank2)
   goals met: 3 of 5
10. (train_unit siege_tank1 siege_tank tank_factory2 tank_factory level2)
   added: (trained siege_tank1)
   goals met: 4 of 5
11. (train_unit tank1 tank tank_factory1 tank_factory level1)
   added: (trained tank1)
   goals met: 5 of 5
